In [1]:
import pandas as pd
from sqlalchemy import create_mock_engine
from sqlalchemy import create_engine
from sqlalchemy import text

engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/final_db')
query = """SELECT tablename FROM pg_catalog.pg_tables
WHERE schemaname = 'public';
"""
with engine.connect() as conn:
  result_df = pd.read_sql(text(query), conn)

result_df

                     tablename
0                   enrollment
1                   assessment
2                   attendance
3                   department
4                       course
5            course_difficulty
6            course_instructor
7                   instructor
8                     semester
9              course_semester
10                     student
11           django_migrations
12         django_content_type
13             auth_permission
14                  auth_group
15      auth_group_permissions
16            auth_user_groups
17  auth_user_user_permissions
18            django_admin_log
19                   auth_user
20              django_session
21         final_app_gparecord
22           final_app_mlmodel

In [4]:
with engine.connect() as conn:
  result_df = pd.read_sql("""
    SELECT 
      s.stu_id,
      s.name,
      e.semester_id,
      AVG(e.grade) AS avg_grade,
      a.attendance_percentage,
      COUNT(a2.assessment_id) AS assessment_count,
      ROUND(AVG(a2.score), 2) AS avg_score
    FROM student s
    JOIN enrollment e ON s.stu_id = e.stu_id
    JOIN attendance a ON e.enroll_id = a.enroll_id
    JOIN assessment a2 ON e.enroll_id = a2.enroll_id
    GROUP BY s.stu_id, e.semester_id, a.attendance_percentage
    ORDER BY s.stu_id, e.semester_id;
  """, conn)

result_df.to_csv('gpa_tracker_ds.csv', index=False)

In [19]:
with engine.connect() as conn:
  result_df = pd.read_sql("SELECT * FROM enrollment", conn)
  

result_df

      enroll_id  stu_id  course_id  semester_id  grade
0             1       1          1            1     80
1             2       1          2            1     76
2             3       1          9            1     32
3             4       1          7            1     32
4             5       1          6            2     99
...         ...     ...        ...          ...    ...
2100       2101     200         18            2     81
2101       2102     200         13            2     74
2102       2103     200         14            3     74
2103       2104     200         19            3     83
2104       2105     200         20            3     55

[2105 rows x 5 columns]

In [20]:
with engine.connect() as conn:
  result_df = pd.read_sql("SELECT * FROM assessment", conn)
  

result_df

      assessment_id  enroll_id assessment_type  score
0                 1          1         Midterm     59
1                 2          1           Final    100
2                 3          1         Project     78
3                 4          2         Midterm     71
4                 5          2           Final     64
...             ...        ...             ...    ...
6310           6311       2104           Final     74
6311           6312       2104         Project     70
6312           6313       2105         Midterm     74
6313           6314       2105           Final     71
6314           6315       2105         Project     51

[6315 rows x 4 columns]